OdFont.getLogFont(System.Void*)
\details
Returns the LOGFONT for this font.
\param lpLogFont [in] Pointer to the buffer to receive the data.
\returns The number of bytes returned in the buffer.
\remarks
The default implementation of this function does nothing but return -1.
If lpLogFont is NULL, the method returns the number of bytes required in the buffer.

OdFont.getDescriptor(OdTtfDescriptor*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets the OdTtfDescriptor for this font.
\param descr [out] TrueType font descriptor.

OdFont.getFileName
\details
Returns the font file name.
\returns The font file name.
\remarks
The default implementation of this function returns an empty string.

OdFont.supportsVerticalMode
\details
Checks whether the font supports vertical mode.
\returns The true value if the font supports vertical mode, or false otherwise.
\remarks
The default implementation of this function returns false.

OdFont.getFontData(System.UInt32!System.Runtime.CompilerServices.IsLong,System.UInt32!System.Runtime.CompilerServices.IsLong,System.Void*,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Returns the font data for the specified character.
\param dwTable [in] Metric table to query.
\param dwOffset [in] Offset into table.
\param pBuffer [in] Pointer to the buffer to receive the data.
\param cbData [in] The length, in bytes, of the information to be retrieved.
\returns The font data for the specified character.
\remarks
The default implementation of this function does nothing but return -1.
The number of bytes returned in the buffer.

OdFont.getScore(System.UInt16,OdGePoint2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d*,OdGePoint3d*,OdTextProperties!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns an array of points over and under the baseline for the specified character in this OdFont object.
\param character [in] Character.
\param advance [in] Offset to next character.
\param pointsOver [in] Array of points over the baseline.
\param pointsUnder [in] Array of points under the baseline.
\param textFlags [in] Text flags.
\returns Array of points over and under the baseline for the specified character in this OdFont object.
\remarks
The default implementation of this function does nothing.
The textFlags parameter must be a combination of one or more of the following:
Name                                Value
OdTextProperties::kNormalText       0x01
OdTextProperties::kVerticalText     0x02
OdTextProperties::kUnderlined       0x04
OdTextProperties::kOverlined        0x08
OdTextProperties::kLastChar         0x10
OdTextProperties::kInBigFont        0x20
OdTextProperties::kInclPenups       0x40

OdFont.getAverageWidth
\details
Returns the average width of characters in this font object.
\returns The average width of characters in this font object.
\remarks
The default implementation of this function always returns 0.0.

OdFont.isShxFont
\details
Checks whether this font object is an SHX font.
\returns The true value if the font object is an SHX font, or false otherwise.
\remarks
The default implementation of this function always returns true.

OdFont.getOverlinePos(System.Double)
\details
Returns the overline position for this font object at the specified text size.
\param textSize [in] Text size.
\returns The overline position for this font object at the specified text size.
\remarks
The default implementation of this function returns 1.2 * textSize.

OdFont.getUnderlinePos(System.Double)
\details
Returns the underline position for this font object at the specified text size.
\param textSize [in] Text size.
\returns The underline position for this font object at the specified text size.
\remarks
The default implementation of this function returns -2.0 * textSize.

OdFont.fontAbove
\details
Returns the height of this font object above the baseline.
\returns The height of this font object above the baseline.
\remarks
The default implementation of this function returns getAbove() unless it is 0.0, in which case this function returns 1.0.

OdFont.getInternalLeading
\details
Returns the internal leading of this font object.
\returns The internal leading of this font object.
\remarks
The default implementation of this function always returns 0.

OdFont.getHeight
\details
Returns the height of this font object.
\returns The height of this font object.

OdFont.hasCharacter(System.UInt16)
\details
Checks whether the specified character is defined in this font object.
\param character [in] Character.
\returns The true value if the specified character is defined in this font object successfully, or an appropriate error code otherwise.

OdFont.getAvailableChars(OdArray&lt;System.UInt16,OdMemoryAllocator&lt;System.UInt16&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns an array of the characters defined in this font object.
\param characters [out] Receives the array of characters.
\returns The array of the characters defined in this font object.

OdFont.getBelow
\details
Returns the depth of this font object below the baseline.
\returns The depth of this font object below the baseline.

OdFont.getAbove
\details
Returns the height of this font object above the baseline.
\returns The height of this font object above the baseline.

OdFont.createCharacterTexture(System.UInt16,System.UInt32!System.Runtime.CompilerServices.IsLong,System.UInt32!System.Runtime.CompilerServices.IsLong,OdTextProperties*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates texture for character.
\param character [in]  Character value.
\param height    [in]  Character height.
\param additionalThickness [in] Additional character thickness.
\param textProperties [in] Text properties.
\returns texture for character if successfully, or null otherwise.

OdFont.drawCharacter(System.UInt16,OdGePoint2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGiConveyorGeometry*,OdTextProperties*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Draws the specified character with this font object.
\param character [in] Character to draw.
\param advance [in] Offset to next character.
\param pGeometry [in] Pointer to the modeler geometry.
\param textProperties [in] Text properties.
\returns Returns eOk if the specified character is drawn with the font object successfully, or an appropriate error code otherwise.

OdFont.drawCharacter(System.UInt16,OdGePoint2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGiCommonDraw*,OdTextProperties*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Draws the specified character with this font object.
\param character [in] Character to draw.
\param advance [in] Offset to next character.
\param pWd [in/out] Draw object that can be used by this function to set the necessary attributes and create the necessary geometry.
\param textProperties [in] Text properties.
\returns Returns eOk if the specified character is drawn with the font object successfully, or an appropriate error code otherwise.

OdFont.initialize(OdStreamBuf*)
\details
Initializes this font object to read font data from the specified StreamBuf object.
\param pStreamBuf [in] Pointer to the StreamBuf object from which the data is to be read.
\returns Returns eOk if the font object is initialized successfully, or an appropriate error code otherwise.

OdFont.addFlag(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Adds the specified font flags to this font object.
\param fontFlags [in] Property font flags to set.
\remarks
Font flags must be a combination of zero or more of the following:
Name              Value
kBigFont10        0x0001
kUniFont10        0x0002
kFont10           0x0004
kFont11           0x0008
kFont10A          0x0010
kTrueType         0x0020
kFontGdt          0x0040
kFontSimplex6     0x0080
kShapes11         0x0100
kFontRsc          0x0200

OdFont.setFlags(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets the font flags for this font object.
\param fontFlags [in] Property font flags to set.
\remarks
Font flags must be a combination of zero or more of the following:
Name              Value
kBigFont10        0x0001
kUniFont10        0x0002
kFont10           0x0004
kFont11           0x0008
kFont10A          0x0010
kTrueType         0x0020
kFontGdt          0x0040
kFontSimplex6     0x0080
kShapes11         0x0100
kFontRsc          0x0200

OdFont.flags
\details
Returns the font flags for this font object.
\returns The font flags for this font object.
\remarks
Returns a combination of zero or more of the following:
Name              Value
kBigFont10        0x0001
kUniFont10        0x0002
kFont10           0x0004
kFont11           0x0008
kFont10A          0x0010
kTrueType         0x0020
kFontGdt          0x0040
kFontSimplex6     0x0080
kShapes11         0x0100
kFontRsc          0x0200

OdFont.getFlags
\details
Returns the font flags for this font object.
\returns The font flags for this font object.
\remarks
Returns a combination of zero or more of the following:
Name              Value
kBigFont10        0x0001
kUniFont10        0x0002
kFont10           0x0004
kFont11           0x0008
kFont10A          0x0010
kTrueType         0x0020
kFontGdt          0x0040
kFontSimplex6     0x0080
kShapes11         0x0100
kFontRsc          0x0200